app/controllers/rg_tasks_controller.rb

SELECT * FROM "rg_tasks" LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "rg_tasks"
---
  def index
    #@rg_tasks = RgTask.all
    @rg_tasks = RgTask.paginate(:per_page => 10, :page => params[:page])

SELECT * FROM "rg_tasks" WHERE ("rg_tasks"."id" = 1)
---
  def show
    @rg_task = RgTask.find(params[:id])

SELECT * FROM "rg_tasks" WHERE ("rg_tasks"."id" = 1)
---
  def edit
    @rg_task = RgTask.find(params[:id])

INSERT INTO "rg_tasks" ("created_at", "worktype", "incremental", "schedule", "namespace", "schema", "updated_at", "url", "disable_validation", "operation", "skip_rehosting", "provider", "worker", "update_if_exists") VALUES('2011-05-19 20:42:54', 'workling', 'f', 'cron( 32 14, 18 * * *)', 'Chores', 'cinesport', '2011-05-19 20:42:54', 'http://api.brightcove.com/services/library?command=find_playlist_by_id&playlist_id=621108944001&token=3uVSa7TMeVzMMezEqd9fe18AutzGOaweR1-b8gJSwJU.&media_delivery=http&output=mrss', 'f', 'from_feed', 'f', 'cinesport', 'import_videos', 'f')
---
  def create
    @rg_task = RgTask.new(params[:rg_task])

    respond_to do |format|
      if @rg_task.save

SELECT * FROM "rg_tasks" WHERE ("rg_tasks"."id" = 1)
UPDATE "rg_tasks" SET "updated_at" = '2011-05-23 15:05:38', "schema" = 'netgreen', "url" = 'http://clientapps.kickapps.com/silverchalice/php/rssfeed.php?as=164595&mediaType=video&setId=81498&videosize=large', "operation" = 'from_feed' WHERE "id" = 31
---
  def update
    @rg_task = RgTask.find(params[:id])

    respond_to do |format|
      if @rg_task.update_attributes(params[:rg_task])

SELECT * FROM "rg_tasks" WHERE ("rg_tasks"."id" = 32)
DELETE FROM "rg_tasks" WHERE "id" = 32
---
  def destroy
    @rg_task = RgTask.find(params[:id])
    @rg_task.destroy